Config/DataProcessors/РМКУправляемыйРежим.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РМКУправляемыйРежим</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФискальныеРегистраторы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧекККМ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМНаВозврат</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыРаботыУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Прейскурант</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБезСкидок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнениеНаименованияНоменклатуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезСкидок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>400</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаркируемыйТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверкиКМ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешительныйРежимИдентификаторЗапросаГИСМТ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешительныйРежимДатаЗапросаГИСМТ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродажаРазрешена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДокументаВет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокументаВет</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокументаВет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПервичныхУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешительныйРежимВерсияБазы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрешительныйРежимИдентификаторЭкземпляраПО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыОплатЧекаККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭквайринговыйТерминал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылочныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЧекаЭТ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПлатежнойКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>24</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеПереданыВБанк</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрыДоговораЭквайринга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПараметрыДоговораЭквайринга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПлатежнойКарты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПлатежныхКарт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязиОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СкидкиНаценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаНаценка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/Enums/СтатусыЧековККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЧековККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отложенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулированный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробитый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архивный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/DataProcessors/РМКУправляемыйРежим/Forms/ФормаQRКода/Ext/Form/Module.bsl
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОповещениеОткрытиеФормыВводаТелефона(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		
		Если ЗначениеЗаполнено(РезультатОткрытияФормы.ВведенноеЧисло) Тогда
			ПреобразоватьТелефонКПользовательскомуВиду(РезультатОткрытияФормы.ВведенноеЧисло, Телефон, ТелефонСтрокой);
			Email 									= "";
			ДанныеSMSИлиEmail 						= ТелефонСтрокой;
			ОтказКлиентаОтСохраненияТелефонаEmail 	= РезультатОткрытияФормы.ОтказКлиентаОтСохраненияТелефона;
			ПроверитьВариантыПлатежаУстановитьВидимостьИДоступностьКлиент();
		Иначе
			Телефон 		= 0;
			ТелефонСтрокой 	= "";
			Email 			= "";
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытиеФормыВводаEmail(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		
		Если ЗначениеЗаполнено(РезультатОткрытияФормы.Email) Тогда
			Email 									= РезультатОткрытияФормы.Email;
			Телефон 								= 0;
			ТелефонСтрокой							= "";
			ДанныеSMSИлиEmail 						= Email;
			ОтказКлиентаОтСохраненияТелефонаEmail 	= РезультатОткрытияФормы.ОтказКлиентаОтСохраненияEmail;
			ПроверитьВариантыПлатежаУстановитьВидимостьИДоступностьКлиент();
		Иначе
			Телефон 		= 0;
			ТелефонСтрокой 	= "";
			Email 			= "";
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПречекЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Доступность = Истина;
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда 
		ЗакрытьФорму = Истина;
		ЭтаФорма.Закрыть();
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуВовзратаЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда 
		РезультатПроверки = ПодтвердитьВозвратНаСервере();
		ЗавершитьВозврат(РезультатПроверки);
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаСБП 					= Параметры.НастройкаСБП;
	СуммаОплаты 					= Параметры.СуммаОплаты;
	КассаККМ						= Параметры.КассаККМ;
	ПараметрыДоговораОплатыПоQRКоду = Параметры.ПараметрыДоговораОплатыПоQRКоду;
	РежимПродажи 					= Параметры.РежимПродажи;
	
	ДанныеКассыККМ 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КассаККМ, "КонтрагентДляРозничныхПродаж, ДоговорДляРозничныхПродаж");
	Контрагент 		= ДанныеКассыККМ.КонтрагентДляРозничныхПродаж;
	Договор 		= ДанныеКассыККМ.ДоговорДляРозничныхПродаж;
	
	ДанныеОборудования 		= ПодключаемоеОборудованиеБГУВызовСервера.ПолучитьПараметрыКассыККМ(КассаККМ);
	ИдентификаторУстройства = ДанныеОборудования.ИдентификаторУстройства;  
	
	Если ЗначениеЗаполнено(ПараметрыДоговораОплатыПоQRКоду) Тогда 
		ДанныеДоговораОплаты 		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыДоговораОплатыПоQRКоду, "ИспользоватьКассовуюСсылку, КассоваяСсылка, ИдентификаторОплаты");
		КассоваяСсылка 				= ДанныеДоговораОплаты.КассоваяСсылка;      
		ИдентификаторОплаты 		= ДанныеДоговораОплаты.ИдентификаторОплаты; 
		ИспользоватьКассовуюСсылку 	= ДанныеДоговораОплаты.ИспользоватьКассовуюСсылку;
	КонецЕсли;	
	
	Элементы.ОбновитьQRКод.Видимость 			= Ложь;
	Элементы.ОплатитьКассовойСсылкой.Видимость 	= Ложь;
	Если РежимПродажи = 0 Тогда 
		Если ИспользоватьКассовуюСсылку И ЗначениеЗаполнено(КассоваяСсылка) Тогда 
			НастроитьЭлементыОплатыКассовойСссылкой();	
		Иначе 	
			ПолучитьQRКодНаОплату();
		КонецЕсли;	
	Иначе
		СоздатьДокументОплаты(Параметры.ДокументОснованиеВозврата);
	КонецЕсли;	
	
	ВозможностьЭлектронногоПлатежа = ВозможностьЭлектронногоПлатежа(КассаККМ.ПодключаемоеОборудование);
	Если ВозможностьЭлектронногоПлатежа Тогда
		ПередачаEmailЧерезПрограмму = КассаККМ.ЭлектронныйЧекEmailПередаютсяПрограммой1С;
		ПередачаSMSЧерезПрограмму  	= КассаККМ.ЭлектронныйЧекSMSПередаютсяПрограммой1С;
	КонецЕсли;
	
	ОтказКлиентаОтСохраненияТелефонаEmail 	= Истина;
	Элементы.КомандаEmail.Видимость 		= ВозможностьЭлектронногоПлатежа;
	Элементы.КомандаSMS.Видимость   		= ВозможностьЭлектронногоПлатежа;
			
	КомандаИзменениеПечатиЧекаСервер(ПечатьЧека);
	
	Если ВозможностьЭлектронногоПлатежа Тогда
		ПроверитьВариантыПлатежаУстановитьВидимостьИДоступностьСервер();
	КонецЕсли;

	
	УстановитьЗаголовки();
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Элементы.ДекорацияСтатус.Заголовок = "Выполняется" И Не ЗакрытьФорму Тогда 
		ТекстВопроса 	= НСтр("ru = 'Оплата еще не выполнена. Закрыть форму?'");
		Оповещение 		= Новый ОписаниеОповещения("ЗакрытьФормуЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		ПередЗакрытиемСервер();
		Отказ = Истина;
	ИначеЕсли Элементы.ДекорацияСтатус.Заголовок <> "Выполнена" Тогда 
		ПередЗакрытиемСервер();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Пречек(Команда)
	
	Доступность 	= Ложь;
	Оповещение 		= Новый ОписаниеОповещения("ПречекЗавершение", ЭтотОбъект);
	Текст = "" + Символы.ПС + НСтр("ru = 'Сумма оплаты: '") + Формат(СуммаОплаты, "ЧФ=""Ч руб.""") + Символы.ПС + "|ШтрихКод|QR|" + СсылкаНаОплату;
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПечатиТекста(Текст);

	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПечатьТекста(Оповещение, УникальныйИдентификатор, ИдентификаторУстройства, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОплату(Команда)
	
	Если ПроверитьСтатусОплаты() = "Выполнена" Тогда
		ПараметрыЗакрытия = ПолучитьПараметрыЗакрытия();
		ЭтаФорма.Закрыть(ПараметрыЗакрытия);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВозврат(Команда)
	
	РезультатПроверки = ВыполнитьВозвратНаСервере();
	Элементы.ВыполнитьВозврат.Доступность = Ложь;
	Если РезультатПроверки.СтатусОперации = "Ошибка" Тогда
		Элементы.ПроверитьВозврат.Доступность = Ложь;	
	КонецЕсли;	
	Если РезультатПроверки.СтатусОперации = "ТребуетсяПодтверждение" Тогда 
		ТекстВопроса 	= НСтр("ru = 'Проверьте реквизиты покупателя. Подтвердить возврат?'");
		Оповещение 		= Новый ОписаниеОповещения("ЗакрытьФормуВовзратаЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	Иначе
		ЗавершитьВозврат(РезультатПроверки)
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаSMS(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытиеФормыВводаТелефона", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок" 						, НСтр("ru = 'Введите номер телефона'"));
	ПараметрыФормы.Вставить("ЧислоВвода"						, Телефон);
	ПараметрыФормы.Вставить("Контрагент"						, Контрагент);
	ПараметрыФормы.Вставить("ОтказКлиентаОтСохраненияТелефона"	, ОтказКлиентаОтСохраненияТелефонаEmail);
	
	ПодключаемоеОборудованиеБГУКлиент.ОткрытьФормуВводаТелефонаДляОтправкиЧерезОФД(ОбработчикОповещения, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаEmail(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытиеФормыВводаEmail", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Email"							, Email);
	ПараметрыФормы.Вставить("Заголовок"						, НСтр("ru = 'Введите адрес электронной почты (Email)'"));
	ПараметрыФормы.Вставить("Контрагент"					, Контрагент);
	ПараметрыФормы.Вставить("ОтказКлиентаОтСохраненияEmail"	, ОтказКлиентаОтСохраненияТелефонаEmail);
	
	ПодключаемоеОборудованиеБГУКлиент.ОткрытьФормуВводаEmailОтправкиЧерезОФД(ОбработчикОповещения, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменениеПечатиЧека(Команда)
	
	ПечатьЧека = НЕ ПечатьЧека;
	
	КомандаИзменениеПечатиЧекаКлиент(ПечатьЧека);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозврат(Команда)
	
	РезультатПроверки = ПроверитьВозвратНаСервере();
	ЗавершитьВозврат(РезультатПроверки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьQRКод(Команда)
	
	ОбновитьQRКодНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗаголовки()
	
	Если РежимПродажи = 1 Тогда 
		Элементы.ДекорацияСтатус.Заголовок 				= "";
		Элементы.ИтогПоЧеку.Заголовок 					= НСтр("ru = 'Сумма возврата'");
		Элементы.ДекорацияЗаголовок.Заголовок 			= НСтр("ru = 'Статус возврата'");
		ЭтаФорма.Заголовок 								= НСтр("ru = 'Возврат оплаты по QR-коду'"); 
		Элементы.АдресКартинки.ТекстНевыбраннойКартинки	= "";
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура ПолучитьQRКодНаОплату()
	
	СоздатьДокументОплаты();

	ПараметрыСсылки = Новый Структура("ДокументОплаты, НастройкаИнтеграции", ДокументОплаты, НастройкаСБП);
	ДанныеСсылки	= ИнтеграцияССервисомПриемаПлатежейБГУ.ИдентификаторОплатыВПлатежнойСистемеСБП(ПараметрыСсылки);
	СсылкаНаОплату 	= ДанныеСсылки.ПлатежнаяСсылка;
	
	Если ЗначениеЗаполнено(ДанныеСсылки.КодОшибки) Тогда 
		Элементы.ОбновитьQRКод.Видимость = Истина;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СсылкаНаОплату) Тогда 
		АдресКартинки = ПоместитьВоВременноеХранилище(СистемаБыстрыхПлатежей.ИзображениеQRКодаСБП(СсылкаНаОплату, 260, 0), ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	ИспользуетсяБезПодключенияОборудования = Истина;
	Если ЗначениеЗаполнено(КассаККМ) Тогда 
		ИспользуетсяБезПодключенияОборудования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КассаККМ, "ИспользоватьБезПодключенияОборудования");
	КонецЕсли;	
	Элементы.Пречек.Доступность = Не ИспользуетсяБезПодключенияОборудования;
	
	Если РежимПродажи = 0 Тогда 
		Элементы.ГруппаПраваяПанельВозврат.Видимость 	= Ложь;
	Иначе
		Элементы.ГруппаПраваяПанельОплата.Видимость 	= Ложь;
		Элементы.ГруппаКонтрагентДоговор.Доступность 	= Ложь;
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Функция ПроверитьСтатусОплаты()
	
	РезультатПроверки = ПереводыСБПc2b.СтатусОплаты(ДокументОплаты, НастройкаСБП, Ложь);	
	Элементы.ДекорацияСтатус.Заголовок = РезультатПроверки.СтатусОперации;
	
	Возврат РезультатПроверки.СтатусОперации; 
	
КонецФункции

&НаСервере
Процедура ПередЗакрытиемСервер()
	
	ДокументОбъет = ДокументОплаты.ПолучитьОбъект();
	ДокументОбъет.ПометкаУдаления 	= Истина;
	ДокументОбъет.СтатусЧекаККМ		= Перечисления.СтатусыЧековККМ.Аннулированный;
	ДокументОбъет.Записать(); 
	
	ДанныеСсылки = Новый Структура;
	ДанныеСсылки.Вставить("КассоваяСсылка"		, КассоваяСсылка);
	ДанныеСсылки.Вставить("ИдентификаторОплаты"	, ИдентификаторОплаты);
	
	РезультатВыполнения = ПереводыСБПc2b.ДеактивироватьКассовуюСсылку(ДанныеСсылки, НастройкаСБП); 
	
	Если ЗначениеЗаполнено(РезультатВыполнения.КодОшибки) Тогда 
		ТекстСообщения = НСтр("ru = 'При выполнении операции возникла ошибка:
		|""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.СообщениеОбОшибке);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);	
	КонецЕсли;
	
КонецПроцедуры	
	
&НаСервере
Процедура СоздатьДокументОплаты(ДокументОснованиеВозврата = Неопределено)
	
	Если РежимПродажи = 0 Тогда 
		ДокументОбъект = Документы.ЧекККМ.СоздатьДокумент();
	Иначе
		ДокументОбъект = Документы.ЧекККМНаВозврат.СоздатьДокумент();
		ДокументОбъект.ЧекККМПродажа = ДокументОснованиеВозврата;
	КонецЕсли;	
	ДокументОбъект.Организация 		= Параметры.Организация;
	ДокументОбъект.СуммаДокумента 	= Параметры.СуммаОплаты;
	ДокументОбъект.Дата				= ТекущаяДата();
	ДокументОбъект.Комментарий 		= НСтр("ru = 'Документ создан из РМК'");
	ДокументОбъект.ФормаОплаты		= 2;
	ДокументОбъект.КассаККМ 		= ЭтотОбъект.КассаККМ;
	
	СтрокаОплаты = ДокументОбъект.Оплата.Добавить();
	
	ДокументОбъект.Записать();
	ДокументОплаты = ДокументОбъект.Ссылка;
	
КонецПроцедуры	
	
&НаСервере
Функция ПолучитьПараметрыЗакрытия()
	
	ВидПлатежнойКарты = Справочники.ВидыПлатежныхКарт.ПустаяСсылка();
	Отбор = Новый Структура("ОсновнойВид", Истина);
	СтрокаВидКарты = ПараметрыДоговораОплатыПоQRКоду.ТарифыЗаРасчетноеОбслуживание.НайтиСтроки(Отбор);
	Если ЗначениеЗаполнено(СтрокаВидКарты) Тогда 
		ВидПлатежнойКарты = СтрокаВидКарты[0].ВидПлатежнойКарты;
	КонецЕсли;
	ПроцентКомиссии = ПолучитьПроцентКомиссии(ВидПлатежнойКарты);
	
	ПараметрыЗакрыитя = Новый Структура;
	ПараметрыЗакрыитя.Вставить("ДокументОплаты"							, ДокументОплаты);
	ПараметрыЗакрыитя.Вставить("Контрагент"								, Контрагент);
	ПараметрыЗакрыитя.Вставить("Договор"								, Договор);
	ПараметрыЗакрыитя.Вставить("ОтказКлиентаОтСохраненияТелефонаEmail"	, ОтказКлиентаОтСохраненияТелефонаEmail);
	ПараметрыЗакрыитя.Вставить("Телефон"								, Формат(Телефон, "ЧЦ=10; ЧДЦ=; ЧГ=0"));
	ПараметрыЗакрыитя.Вставить("Email"									, Email);
	ПараметрыЗакрыитя.Вставить("Сумма"									, СуммаОплаты);
	ПараметрыЗакрыитя.Вставить("СуммаОплачено"							, СуммаОплаты);
	ПараметрыЗакрыитя.Вставить("СуммаСдачи"  							, 0);
	
	ПараметрыЗакрыитя.Вставить("НомерПлатежнойКарты"					, "");
	ПараметрыЗакрыитя.Вставить("СсылочныйНомер"  						, "");
	ПараметрыЗакрыитя.Вставить("НомерЧекаЭТ"  							, "");
	ПараметрыЗакрыитя.Вставить("ЭквайринговыйТерминал"					, ПолучитьЭквайринговыйТерминал());
	ПараметрыЗакрыитя.Вставить("ПараметрыДоговораЭквайринга"			, ПараметрыДоговораОплатыПоQRКоду);
	ПараметрыЗакрыитя.Вставить("ПроцентКомиссии"						, ПроцентКомиссии);
	ПараметрыЗакрыитя.Вставить("ВидПлатежнойКарты"						, ВидПлатежнойКарты);
	ПараметрыЗакрыитя.Вставить("СуммаКомиссии"							, СуммаОплаты/100*ПроцентКомиссии);

	Возврат ПараметрыЗакрыитя;
	
КонецФункции	
	
&НаСервере
Функция ПолучитьПроцентКомиссии(ВидПлатежнойКарты) 
	
	Если ЗначениеЗаполнено(ВидПлатежнойКарты) Тогда 
		СтрокаТариф = ПараметрыДоговораОплатыПоQRКоду.ТарифыЗаРасчетноеОбслуживание.Найти(ВидПлатежнойКарты, "ВидПлатежнойКарты");	
		Возврат СтрокаТариф.ПроцентТорговойУступки;
	Иначе 
		Возврат 0;
	КонецЕсли;	
	
КонецФункции

&НаСервере
Функция ПолучитьЭквайринговыйТерминал()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	ПараметрыДоговораЭквайрингаТерминалы.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал
	               |ИЗ
	               |	Справочник.ПараметрыДоговораЭквайринга.Терминалы КАК ПараметрыДоговораЭквайрингаТерминалы
	               |ГДЕ
	               |	ПараметрыДоговораЭквайрингаТерминалы.Ссылка = &Ссылка";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ПараметрыДоговораОплатыПоQRКоду);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда 
		Возврат РезультатЗапроса.ЭквайринговыйТерминал;
	Иначе
		Возврат Справочники.ПараметрыДоговораЭквайринга.ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции	

&НаСервере
Функция ВыполнитьВозвратНаСервере()
	
	ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОплаты, "ЧекККМПродажа");
	РезультатПроверки = ПереводыСБПc2b.ВозвратОплаты(ДокументОплаты, ДокументОснование, НастройкаСБП); 
	Элементы.ДекорацияСтатус.Заголовок = РезультатПроверки.СтатусОперации;
	Возврат РезультатПроверки;
	
КонецФункции	

&НаСервере
Функция ПроверитьВозвратНаСервере()
	
	ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОплаты, "ЧекККМПродажа");
	РезультатПроверки = ПереводыСБПc2b.СтатусВозврата(ДокументОснование, НастройкаСБП, Ложь);
	Возврат РезультатПроверки;

КонецФункции

&НаСервере
Функция ПодтвердитьВозвратНаСервере()
	
	ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОплаты, "ЧекККМПродажа");
	РезультатПроверки = ПереводыСБПc2b.ПодтвердитьВозврат(ДокументОснование, НастройкаСБП);
	Возврат РезультатПроверки; 
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьВозврат(РезультатПроверки)
	
	Элементы.ДекорацияСтатус.Заголовок = РезультатПроверки.СтатусОперации;
	Если РезультатПроверки.СтатусОперации = "Выполнена" Тогда
		ПараметрыЗакрытия = ПолучитьПараметрыЗакрытия();
		ЭтаФорма.Закрыть(ПараметрыЗакрытия);
	КонецЕсли;
	
КонецПроцедуры	
	
&НаКлиенте
Процедура КомандаИзменениеПечатиЧекаКлиент(ВключитьКартинкуПечати)
	
	Если ВключитьКартинкуПечати Тогда
		Элементы.КомандаИзменениеПечатиЧека.Картинка = БиблиотекаКартинок.ПечатьЧека;
	Иначе
		Элементы.КомандаИзменениеПечатиЧека.Картинка = БиблиотекаКартинок.ОтказОтПечатиЧека;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КомандаИзменениеПечатиЧекаСервер(ВключитьКартинкуПечати)
	
	Если ВключитьКартинкуПечати Тогда
		Элементы.КомандаИзменениеПечатиЧека.Картинка = БиблиотекаКартинок.ПечатьЧека;
	Иначе
		Элементы.КомандаИзменениеПечатиЧека.Картинка = БиблиотекаКартинок.ОтказОтПечатиЧека;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПреобразоватьТелефонКПользовательскомуВиду(ВведенноеЧисло, Телефон, ТелефонСтрокой) Экспорт
	
	ВведенноеЧислоСтрокой = Формат(ВведенноеЧисло, "ЧГ=0");
	ВведенноеЧислоСтрокой = Лев(ВведенноеЧислоСтрокой, 10);
	Телефон = Число(ВведенноеЧислоСтрокой);
	Если СтрДлина(ВведенноеЧислоСтрокой) < 10 Тогда
		ВведенноеЧислоСтрокой = Формат(ВведенноеЧисло, "ЧЦ=10; ЧДЦ=; ЧВН=; ЧГ=0");
	КонецЕсли;
	
	ТелефонСтрокой = "+7(";
	ТелефонСтрокой = ТелефонСтрокой + Сред(ВведенноеЧислоСтрокой, 1, 3);
	ТелефонСтрокой = ТелефонСтрокой + ")";
	ТелефонСтрокой = ТелефонСтрокой + Сред(ВведенноеЧислоСтрокой, 4, 3);
	ТелефонСтрокой = ТелефонСтрокой + "-";
	ТелефонСтрокой = ТелефонСтрокой + Сред(ВведенноеЧислоСтрокой, 7, 2);
	ТелефонСтрокой = ТелефонСтрокой + "-";
	ТелефонСтрокой = ТелефонСтрокой + Сред(ВведенноеЧислоСтрокой, 9, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВариантыПлатежаУстановитьВидимостьИДоступностьКлиент()
	
	ВозможностьОтправкиSMS 			= ВозможностьЭлектронногоПлатежа;
	ВозможностьОтправкиEmail 		= ВозможностьЭлектронногоПлатежа;
	ВозможностьОтказаОтПечатиЧека 	= Ложь;
	Если (ВозможностьОтправкиSMS И ЗначениеЗаполнено(Телефон) И НЕ ПередачаSMSЧерезПрограмму)
		ИЛИ (ВозможностьОтправкиEmail И ЗначениеЗаполнено(Email) И НЕ ПередачаEmailЧерезПрограмму) Тогда
		
		ВозможностьОтказаОтПечатиЧека = Истина;
		
	КонецЕсли;
	
	Элементы.КомандаEmail.Видимость                 = ВозможностьОтправкиEmail;
	Элементы.КомандаSMS.Видимость                   = ВозможностьОтправкиSMS;
	Элементы.КомандаИзменениеПечатиЧека.Видимость 	= ВозможностьОтказаОтПечатиЧека;
	Элементы.ГруппаДанныеSMSИEmail.Видимость        = ВозможностьЭлектронногоПлатежа;
	
	Если ВозможностьОтказаОтПечатиЧека Тогда
		ПечатьЧека = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВариантыПлатежаУстановитьВидимостьИДоступностьСервер()
	
	ВозможностьОтправкиSMS 			= ВозможностьЭлектронногоПлатежа;
	ВозможностьОтправкиEmail 		= ВозможностьЭлектронногоПлатежа;
	ВозможностьОтказаОтПечатиЧека	= Ложь;
	Если (ВозможностьОтправкиSMS И ЗначениеЗаполнено(Телефон) И НЕ ПередачаSMSЧерезПрограмму)
		ИЛИ (ВозможностьОтправкиEmail И ЗначениеЗаполнено(Email) И НЕ ПередачаEmailЧерезПрограмму) Тогда
		
		ВозможностьОтказаОтПечатиЧека = Истина;
		
	КонецЕсли;
	
	Элементы.КомандаEmail.Видимость                 = ВозможностьОтправкиEmail;
	Элементы.КомандаSMS.Видимость                   = ВозможностьОтправкиSMS;
	Элементы.КомандаИзменениеПечатиЧека.Видимость 	= ВозможностьОтказаОтПечатиЧека;
	Элементы.ГруппаДанныеSMSИEmail.Видимость        = ВозможностьЭлектронногоПлатежа;
	
	Если ВозможностьОтказаОтПечатиЧека Тогда
		ПечатьЧека = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()
	
	Элементы.КомандаEmail.Доступность = ВозможностьЭлектронногоПлатежа;
	Элементы.КомандаSMS.Доступность   = ВозможностьЭлектронногоПлатежа;
		
	Если ЗначениеЗаполнено(ДанныеSMSИлиEmail) Тогда
		Если ОтказКлиентаОтСохраненияТелефонаEmail Тогда
			Элементы.ДекорацияОтказКлиентаОтСохраненияТелефонаEmail.Картинка = БиблиотекаКартинок.НеСохранять16;
		Иначе
			Элементы.ДекорацияОтказКлиентаОтСохраненияТелефонаEmail.Картинка = БиблиотекаКартинок.Сохранить16;
		КонецЕсли;
	Иначе
		Элементы.ДекорацияОтказКлиентаОтСохраненияТелефонаEmail.Картинка = БиблиотекаКартинок.Пустая;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВозможностьЭлектронногоПлатежа(ПодключаемоеОборудование)
	
	Если НЕ ЗначениеЗаполнено(ПодключаемоеОборудование) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПодключаемоеОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь
	
КонецФункции

&НаСервере
Процедура ОбновитьQRКодНаСервере()
	
	ПараметрыСсылки = Новый Структура("ДокументОплаты, НастройкаИнтеграции", ДокументОплаты, НастройкаСБП);
	ДанныеСсылки	= ИнтеграцияССервисомПриемаПлатежейБГУ.ИдентификаторОплатыВПлатежнойСистемеСБП(ПараметрыСсылки);
	СсылкаНаОплату 	= ДанныеСсылки.ПлатежнаяСсылка;
		
	Если ЗначениеЗаполнено(СсылкаНаОплату) Тогда 
		АдресКартинки = ПоместитьВоВременноеХранилище(СистемаБыстрыхПлатежей.ИзображениеQRКодаСБП(СсылкаНаОплату, 260, 0), ЭтаФорма.УникальныйИдентификатор);
		Элементы.ОбновитьQRКод.Видимость 	= Ложь;
		Элементы.Пречек.Видимость			= Истина;
		Элементы.ПроверитьОплату.Видимость	= Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыОплатыКассовойСссылкой()
	
	СоздатьДокументОплаты();
	
	Элементы.АдресКартинки.ТекстНевыбраннойКартинки	= "";
	Элементы.ОбновитьQRКод.Заголовок 				= НСтр("ru = 'Получить QR-код (Ctrl + F5)'");;
	Элементы.ОбновитьQRКод.Видимость 				= Истина;
	Элементы.ОплатитьКассовойСсылкой.Видимость 		= Истина;
	Элементы.Пречек.Видимость		 				= Ложь;
	Элементы.ПроверитьОплату.Видимость 				= Ложь;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОплатаКассовойСсылкой(Команда)
	
	ОплатаКассовойСсылкойСервер();
	
КонецПроцедуры 

&НаСервере
Процедура ОплатаКассовойСсылкойСервер()
	
	ДанныеСсылки = Новый Структура;
	ДанныеСсылки.Вставить("КассоваяСсылка"		, КассоваяСсылка);
	ДанныеСсылки.Вставить("ИдентификаторОплаты"	, ИдентификаторОплаты);
	
	РезультатВыполнения = ПереводыСБПc2b.АктивироватьКассовуюСсылку(ДокументОплаты, ДанныеСсылки, НастройкаСБП); 
	
	Если ЗначениеЗаполнено(РезультатВыполнения.КодОшибки) Тогда 
		ТекстСообщения = НСтр("ru = 'При выполнении операции возникла ошибка:
		|""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.СообщениеОбОшибке);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);	
	Иначе
		Элементы.ПроверитьОплату.Видимость = Истина;	
	КонецЕсли;	
	
КонецПроцедуры
	
#КонецОбласти
